guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_grtc.c
    while (mask)
    {
        // Calculating number of channels by counting ones inside given mask.
        ch_count += mask & 0x1;
        mask >>= 1;
    }
    return ch_count;
}

static uint32_t allocated_channels_mask_get(void)
{
    return NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK & ~m_cb.available_channels;
}

static uint32_t used_channels_mask_get(void)
{
    return NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK & m_cb.used_channels;
}

#if NRFY_GRTC_HAS_EXTENDED
static bool is_syscounter_running(void)
{
    return nrfy_grtc_sys_counter_check(NRF_GRTC);
}
#endif

static bool is_channel_used(uint8_t channel)
{
    return (GRTC_CHANNEL_TO_BITMASK(channel) & used_channels_mask_get());
}

static bool is_channel_allocated(uint8_t channel)
{
    return (GRTC_CHANNEL_TO_BITMASK(channel) & allocated_channels_mask_get());
}

static void channel_used_mark(uint8_t channel)
{
    m_cb.used_channels |= GRTC_CHANNEL_TO_BITMASK(channel);
}

static void channel_used_unmark(uint8_t channel)
{
    m_cb.used_channels &= ~GRTC_CHANNEL_TO_BITMASK(channel);
}

static bool is_channel_available(uint8_t channel)
{
    return (GRTC_CHANNEL_TO_BITMASK(channel) & NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK);
}

static nrfx_err_t syscounter_check(uint8_t channel)
{
    if (!is_channel_available(channel))
    {
        return NRFX_ERROR_FORBIDDEN;
    }
    if (!is_channel_allocated(channel))
    {
        return NRFX_ERROR_INVALID_PARAM;
    }
    return NRFX_SUCCESS;
}

static uint8_t get_channel_for_ch_data_idx(uint8_t idx)
{
    uint32_t ch_mask = NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK;

    for (uint8_t i = 0; i < idx; i++)
    {
        ch_mask &= ~(1UL << NRF_CTZ(ch_mask));
    }
    return (uint8_t)NRF_CTZ(ch_mask);
}

static uint8_t get_ch_data_index_for_channel(uint8_t channel)
{
    uint32_t ch_mask = NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK;
    uint8_t  idx;

    for (idx = 0; channel != NRF_CTZ(ch_mask); idx++)
    {
        ch_mask &= ~(1UL << NRF_CTZ(ch_mask));
    }
    return idx;
}

static void cc_channel_prepare(nrfx_grtc_channel_t * p_chan_data)
{
    NRFX_ASSERT(p_chan_data);
    uint8_t ch_data_idx = get_ch_data_index_for_channel(p_chan_data->channel);

    nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, p_chan_data->channel);

    m_cb.channel_data[ch_data_idx].handler   = p_chan_data->handler;
    m_cb.channel_data[ch_data_idx].p_context = p_chan_data->p_context;
    m_cb.channel_data[ch_data_idx].channel   = p_chan_data->channel;
    channel_used_mark(p_chan_data->channel);
}

#if NRFY_GRTC_HAS_EXTENDED
static void sleep_configure(nrfx_grtc_sleep_config_t const * p_sleep_cfg)
{
    nrfy_grtc_sys_counter_auto_mode_set(NRF_GRTC, p_sleep_cfg->auto_mode);
    nrfy_grtc_timeout_set(NRF_GRTC, p_sleep_cfg->timeout);
    nrfy_grtc_waketime_set(NRF_GRTC, p_sleep_cfg->waketime);
}

static void sleep_configuration_get(nrfx_grtc_sleep_config_t * p_sleep_cfg)
{
    p_sleep_cfg->auto_mode = nrfy_grtc_sys_counter_auto_mode_check(NRF_GRTC);
    p_sleep_cfg->timeout = nrfy_grtc_timeout_get(NRF_GRTC);
    p_sleep_cfg->waketime = nrfy_grtc_waketime_get(NRF_GRTC);
}
#endif /* NRFY_GRTC_HAS_EXTENDED */

static inline bool active_check(void)
{
#if NRFY_GRTC_HAS_SYSCOUNTER_ARRAY
    return nrfy_grtc_sys_counter_active_check(NRF_GRTC);
#else
    return nrfy_grtc_sys_counter_active_state_request_check(NRF_GRTC);
#endif
}

static inline void active_set(bool active)
{
#if defined(NRF_GRTC_HAS_SYSCOUNTER_ARRAY) && (NRF_GRTC_HAS_SYSCOUNTER_ARRAY == 1)
    nrfy_grtc_sys_counter_active_set(NRF_GRTC, active);
#else
    nrfy_grtc_sys_counter_active_state_request_set(NRF_GRTC, active);
#endif
}

static inline bool ready_check(void)
{
    return nrfy_grtc_sys_counter_ready_check(NRF_GRTC);
}

bool nrfx_grtc_active_request_check(void)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    return active_check();
}

void nrfx_grtc_active_request_set(bool active)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    active_set(active);
}

bool nrfx_grtc_ready_check(void)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    return ready_check();
}

nrfx_err_t nrfx_grtc_syscounter_get(uint64_t * p_counter)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);
    NRFX_ASSERT(p_counter);
    *p_counter = 0;

    nrfx_err_t err_code = NRFX_SUCCESS;
#if NRFY_GRTC_HAS_EXTENDED
    if (!is_syscounter_running())
    {
        err_code = NRFX_ERROR_INTERNAL;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
#endif // NRFY_GRTC_HAS_EXTENDED
    NRFX_CRITICAL_SECTION_ENTER();
    *p_counter = nrfy_grtc_sys_counter_get(NRF_GRTC);
    NRFX_CRITICAL_SECTION_EXIT();

    return err_code;
}

nrfx_err_t nrfx_grtc_channel_alloc(uint8_t * p_channel)
{
    NRFX_ASSERT(p_channel);
    nrfx_err_t err_code = nrfx_flag32_alloc(&m_cb.available_channels, p_channel);

    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
    }

    NRFX_LOG_INFO("GRTC channel %u allocated.", *p_channel);
    return err_code;
}

nrfx_err_t nrfx_grtc_channel_free(uint8_t channel)
{
    NRFX_ASSERT(channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
    nrfx_err_t err_code;

    channel_used_unmark(channel);
    if (!is_channel_available(channel))
    {
        err_code = NRFX_ERROR_FORBIDDEN;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    err_code = nrfx_flag32_free(&m_cb.available_channels, channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    NRFX_LOG_INFO("GRTC channel %u freed.", channel);
    return err_code;
}

bool nrfx_grtc_is_channel_used(uint8_t channel)
{
    return is_channel_used(channel);
}

nrfx_err_t nrfx_grtc_init(uint8_t interrupt_priority)
{
    nrfx_err_t err_code = NRFX_SUCCESS;

    if (m_cb.state != NRFX_DRV_STATE_UNINITIALIZED)
    {
#if NRFX_API_VER_AT_LEAST(3, 2, 0)
        err_code = NRFX_ERROR_ALREADY;
#else
        err_code = NRFX_ERROR_INVALID_STATE;
#endif
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

