guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_grtc.c
    nrf_grtc_task_t task = (nrf_grtc_task_t)action;
    nrfy_grtc_task_trigger(NRF_GRTC, task);

    NRFX_LOG_INFO("GRTC %s action.", GRTC_ACTION_TO_STR(action));
    return err_code;
}
#endif // NRFY_GRTC_HAS_EXTENDED

void nrfx_grtc_uninit(void)
{
    uint32_t ch_mask = allocated_channels_mask_get();

    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, GRTC_ALL_INT_MASK);

    for (uint8_t chan = 0; ch_mask; chan++, ch_mask >>= 1)
    {
        if (is_channel_used(chan))
        {
            channel_used_unmark(chan);
            if (is_channel_allocated(chan))
            {
                nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, chan);
                if (ch_mask & 0x1)
                {
                    (void)nrfx_flag32_free(&m_cb.available_channels, chan);
                }
            }
        }
    }
    nrfy_grtc_int_uninit(NRF_GRTC);

#if NRFY_GRTC_HAS_SYSCOUNTER_ARRAY
    nrfy_grtc_sys_counter_active_set(NRF_GRTC, false);
#else
    nrfy_grtc_sys_counter_active_state_request_set(NRF_GRTC, false);
#endif

#if NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART)
    nrfy_grtc_sys_counter_auto_mode_set(NRF_GRTC, false);
    nrfy_grtc_sys_counter_set(NRF_GRTC, false);
    nrf_grtc_task_trigger(NRF_GRTC, NRF_GRTC_TASK_STOP);
    nrf_grtc_task_trigger(NRF_GRTC, NRF_GRTC_TASK_CLEAR);
#endif // NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART)

    m_cb.state = NRFX_DRV_STATE_UNINITIALIZED;
    NRFX_LOG_INFO("GRTC uninitialized.");
}

bool nrfx_grtc_init_check(void)
{
    return (m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
}

#if NRF_GRTC_HAS_RTCOUNTER
void nrfx_grtc_rtcounter_cc_int_enable(bool sync)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    nrf_grtc_event_t event = sync ? NRF_GRTC_EVENT_RTCOMPARE : NRF_GRTC_EVENT_RTCOMPARESYNC;

    nrfy_grtc_event_clear(NRF_GRTC, event);
    nrfy_grtc_int_enable(NRF_GRTC, NRFY_EVENT_TO_INT_BITMASK(event));
    NRFX_LOG_INFO("GRTC RTCOMPARE%s interrupt enabled.", sync ? "SYNC" : "");
}

void nrfx_grtc_rtcounter_cc_int_disable(void)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_INT_RTCOMPARE_MASK | NRF_GRTC_INT_RTCOMPARESYNC_MASK);
    NRFX_LOG_INFO("GRTC RTCOMPARE/RTCOMPARESYNC interrupt disabled.");
}
#endif // NRF_GRTC_HAS_RTCOUNTER

#if NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
void nrfx_grtc_syscountervalid_int_enable(nrfx_grtc_syscountervalid_handler_t handler,
                                          void *                              p_context)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    m_cb.syscountervalid_handler = handler;
    m_cb.syscountervalid_context = p_context;
    nrfy_grtc_int_enable(NRF_GRTC, NRFY_EVENT_TO_INT_BITMASK(NRF_GRTC_EVENT_SYSCOUNTERVALID));
    NRFX_LOG_INFO("GRTC SYSCOUNTERVALID interrupt enabled.");
}

void nrfx_grtc_syscountervalid_int_disable(void)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_INT_SYSCOUNTERVALID_MASK);
    NRFX_LOG_INFO("GRTC SYSCOUNTERVALID interrupt disabled.");
}
#endif // NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID

nrfx_err_t nrfx_grtc_syscounter_cc_disable(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    uint32_t   int_mask = NRF_GRTC_CHANNEL_INT_MASK(channel);
    nrfx_err_t err_code = syscounter_check(channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    if (!is_channel_used(channel))
    {
        err_code = NRFX_ERROR_INVALID_PARAM;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    channel_used_unmark(channel);

    nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, channel);

    if (nrfy_grtc_int_enable_check(NRF_GRTC, int_mask))
    {
        nrfy_grtc_int_disable(NRF_GRTC, int_mask);
        if (nrfy_grtc_sys_counter_compare_event_check(NRF_GRTC, channel))
        {
            nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, channel);
            err_code = NRFX_ERROR_TIMEOUT;
            NRFX_LOG_WARNING("Function: %s, error code: %s.",
                             __func__,
                             NRFX_LOG_ERROR_STRING_GET(err_code));
            return err_code;
        }
    }
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare for channel %u disabled.", (uint32_t)channel);
    return err_code;
}

nrfx_err_t nrfx_grtc_syscounter_cc_absolute_set(nrfx_grtc_channel_t * p_chan_data,
                                                uint64_t              val,
                                                bool                  enable_irq)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    NRFX_ASSERT(p_chan_data);
    nrfx_err_t err_code = syscounter_check(p_chan_data->channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    cc_channel_prepare(p_chan_data);
    NRFX_CRITICAL_SECTION_ENTER();
    nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, p_chan_data->channel);
    nrfy_grtc_sys_counter_cc_set(NRF_GRTC, p_chan_data->channel, val);
    NRFX_CRITICAL_SECTION_EXIT();

    if (enable_irq)
    {
        nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(p_chan_data->channel));
    }

    NRFX_LOG_INFO("GRTC SYSCOUNTER absolute compare for channel %u set to %u.",
                  (uint32_t)p_chan_data->channel,
                  (uint32_t)nrfy_grtc_sys_counter_cc_get(NRF_GRTC, p_chan_data->channel));
    return err_code;
}

nrfx_err_t nrfx_grtc_syscounter_cc_relative_set(nrfx_grtc_channel_t *             p_chan_data,
                                                uint32_t                          val,
                                                bool                              enable_irq,
                                                nrfx_grtc_cc_relative_reference_t reference)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    NRFX_ASSERT(p_chan_data);
    nrfx_err_t err_code = syscounter_check(p_chan_data->channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    cc_channel_prepare(p_chan_data);
    NRFX_CRITICAL_SECTION_ENTER();
    nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, p_chan_data->channel);
    {
        nrfy_grtc_sys_counter_cc_add_set(NRF_GRTC,
                                         p_chan_data->channel,
                                         val,
                                         (nrf_grtc_cc_add_reference_t)reference);
    }
    NRFX_CRITICAL_SECTION_EXIT();

    if (enable_irq)
    {
        nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(p_chan_data->channel));
    }

