guangli2015/freertos_nRF54l15/Source/nrfx/drivers/src/nrfx_grtc.c
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare for channel %u set to %u.",
                  (uint32_t)p_chan_data->channel,
                  (uint32_t)val);
    return err_code;
}

nrfx_err_t nrfx_grtc_syscounter_cc_int_disable(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    nrfx_err_t err_code = syscounter_check(channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    if (!is_channel_used(channel))
    {
        err_code = NRFX_ERROR_INVALID_PARAM;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_CHANNEL_INT_MASK(channel));
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare interrupt for channel %u disabled.", (uint32_t)channel);
    return err_code;
}

nrfx_err_t nrfx_grtc_syscounter_cc_int_enable(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    nrfx_err_t err_code = syscounter_check(channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    channel_used_mark(channel);
    nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(channel));
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare interrupt for channel %u enabled.", (uint32_t)channel);
    return err_code;
}

bool nrfx_grtc_syscounter_cc_int_enable_check(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    NRFX_ASSERT(channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
    return nrfy_grtc_int_enable_check(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(channel));
}

nrfx_err_t nrfx_grtc_syscounter_capture(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    nrfx_err_t err_code = syscounter_check(channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    channel_used_mark(channel);
    nrfy_grtc_task_trigger(NRF_GRTC, nrfy_grtc_sys_counter_capture_task_get(channel));

    NRFX_LOG_INFO("GRTC SYSCOUNTER capture for channel %u triggered.", (uint32_t)channel);
    return err_code;
}

nrfx_err_t nrfx_grtc_syscounter_cc_value_read(uint8_t channel, uint64_t * p_val)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    NRFX_ASSERT(p_val);
    nrfx_err_t err_code = syscounter_check(channel);
    if (err_code != NRFX_SUCCESS)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    if (!is_channel_used(channel))
    {
        err_code = NRFX_ERROR_INVALID_PARAM;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    *p_val = nrfy_grtc_sys_counter_cc_get(NRF_GRTC, channel);

    NRFX_LOG_INFO("GRTC SYSCOUNTER capture for channel %u read: %llu.", (uint32_t)channel, *p_val);
    return err_code;
}

static void grtc_irq_handler(void)
{
    uint32_t evt_to_process = GRTC_CHANNEL_MASK_TO_INT_MASK(allocated_channels_mask_get() &
                                                            used_channels_mask_get());
#if NRF_GRTC_HAS_RTCOUNTER
    evt_to_process |= (GRTC_NON_SYSCOMPARE_INT_MASK & ~NRF_GRTC_INT_SYSCOUNTERVALID_MASK);
#endif
    uint32_t         event_mask      = nrfy_grtc_events_process(NRF_GRTC, evt_to_process);
    uint32_t         active_int_mask = nrfy_grtc_int_enable_check(NRF_GRTC, event_mask);
    nrf_grtc_event_t event;

    for (uint32_t i = 0; i < NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS; i++)
    {
        uint8_t channel = m_cb.channel_data[i].channel;

        event = nrfy_grtc_sys_counter_compare_event_get(channel);
        if (active_int_mask & NRFY_EVENT_TO_INT_BITMASK(event))
        {
            NRFX_LOG_INFO("Event: NRF_GRTC_EVENT_COMPARE_%d.", channel);
            if (m_cb.channel_data[i].handler)
            {
                m_cb.channel_data[i].handler((int32_t)channel,
                                             nrfy_grtc_sys_counter_cc_get(NRF_GRTC, channel),
                                             m_cb.channel_data[i].p_context);
            }
        }
    }
#if NRF_GRTC_HAS_RTCOUNTER
    if (active_int_mask & NRF_GRTC_INT_RTCOMPARE_MASK)
    {
        NRFX_LOG_INFO("Event: NRF_GRTC_EVENT_RTCOMPARE.");
        nrfx_grtc_channel_t const * p_channel = &m_cb.channel_data[GRTC_RTCOUNTER_CC_HANDLER_IDX];
        if (p_channel->handler)
        {
            p_channel->handler((int32_t)GRTC_RTCOUNTER_COMPARE_CHANNEL,
                               nrfy_grtc_rt_counter_cc_get(NRF_GRTC),
                               p_channel->p_context);
        }
    }

    if (active_int_mask & NRF_GRTC_INT_RTCOMPARESYNC_MASK)
    {
        NRFX_LOG_INFO("Event: NRF_GRTC_EVENT_RTCOMPARESYNC.");
        if (m_cb.rtcomparesync_handler)
        {
            m_cb.rtcomparesync_handler(m_cb.rtcomparesync_context);
        }
    }
#endif // NRF_GRTC_HAS_RTCOUNTER
#if NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
    /* The SYSCOUNTERVALID bit is automatically cleared when GRTC goes into sleep state and set
     * when returning from this state. It can't be cleared inside the ISR procedure because we rely
     * on it during SYSCOUNTER value reading procedure. */
    if (nrfy_grtc_event_check(NRF_GRTC, NRF_GRTC_EVENT_SYSCOUNTERVALID) &&
        nrfy_grtc_int_enable_check(NRF_GRTC, NRF_GRTC_INT_SYSCOUNTERVALID_MASK))
    {
        NRFX_LOG_INFO("Event: NRF_GRTC_EVENT_SYSCOUNTERVALID.");
        if (m_cb.syscountervalid_handler)
        {
            m_cb.syscountervalid_handler(m_cb.syscountervalid_context);
        }
    }
#endif // NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
}

void nrfx_grtc_irq_handler(void)
{
    grtc_irq_handler();
}

#endif // NRFX_CHECK(NRFX_GRTC_ENABLED)
